function closePopup() {
    window.close();
  }
  
  document.querySelector(".Location_Popup_Cancel").addEventListener("click", closePopup);
  document.querySelector(".Location_Popup_Submit").addEventListener("click", closePopup);
  
  function press(e) {
    const state = document.getElementById("state") ;
    state.innerText = "";
    state1.innerText = "";

  
    const seoul = ["전체","강남역","여의도","홍대","잠실","건대","이태원","성수","사당역","강남","을지로","강화문","서울역","강남구","강동구","강북구","강서구","관악구","광진구","구로구","금천구","노원구","도봉구","동대문구","동작구","마포구","서대문구","서초구","성동구","성북구","송파구","양천구","영등포구","용산구","은평구","종로구","중구","중랑구"];
    const gangwon = ["전체","강릉","속초","춘천","양양","원주","고성","홍천","삼척","평창","정선","주문진","횡성","강릉시","고성군","동해시","삼척시","속초시","양구군","양양군","영월군","원주시","인제군","정선군","철원군","춘천시","태백시","평창군","홍천군","화천군","횡성군"];
    const gyeonggi = ["전체","파주","수원","일산","판교","수원역","의정부","남양주","김포","동탄","양평","부천","용인","가평군","고양시","고양시 덕양구","고양시 일산동구","고양시 일산서구","과천시","광명시","광주시","구리시","군포시","김포시","남양주시","동두천시","부천시","성남시","성남시 분당구","성남시 수정구","성남시 중원구","수원시","수원시 권선구","수원시 영통구","수원시 장안구","수원시 팔달구","시흥시","안산시","안산시 단원구","안산시 상록구","안성시","안양시","안양시 동안구","안양시 만안구","양주시","양평군","여주시","연천군","오산시","용인시","용인시 기흥구","용인시 수지구","용인시 처인구","의왕시","의정부시","이천시","파주시","평택시","포천시","하남시","화성시"];
    const gyeongnam = ["전체","통영","진주","고성","창원","김해","거제","거제도","마산","양산","밀양","남해","사천","거제시","거창군","고성군","김해시","남해군","밀양시","사천시","산청군","양산시","의령군","진주시","창녕군","창원시","창원시 마산합포구","창원시 마산회원구","창원시 성산구","창원시 의창구","창원시 진해구","통영시","하동군","함안군"];
    const gyeongbug = ["전체","경주","포항","안동","문경","구미","경산","울릉도","황리단길","김천","영주","울진","경산시","경주시","고령군","구미시","군위군","김천시","문경시","봉화군","상주시","성주군","안동시","영덕군","영양군"];
    const gwangju = ["전체","양산","첨단","상무지구","수완지구","상무","두정동","충장로","금호동","전남대","전대후문","광산구","남구","동구","북구","서구"];
    const daegu = ["전체","동성로","동대구역","수성못","팔공산","수성구","동대구","상인동","동천동","삼덕동","궁동","남구","달서구","달성군","동구","북구","서구","수성구","중구"];
    const daejeon = ["전체","시청역","둔산동","대전역","관저동","유성구","유성","은행동","만년동","갈마동","탄방동","대덕구","동구","서구","유성구","중구"];
    const busan = ["전체","해운대","서면","광안리","부산역","남포동","시청역","기장","부산대","영도","동래","다대포","경성대","강서구","금정구","기장군","남구","동구","동래구","부산진구","북구","사상구","사하구","서구","수영구","연제구","영도구","중구","해운대구"];
    const sejong = ["전체","조치원","고복저수지","가람동","고운동","금남면","나성동","다정동","대평동","도담동","반곡동","보람동","부강면","산울동","새롬동","소담동","소정면","아름동","어진동","연기면","연동면","연서면","장군면","전동면","전의면","조치원읍","중촌동","집현동","한솔동","합강동","해밀동"];
    const ulsan = ["전체","일산","삼산","무거동","구영리","울주군","울산북구","울산성남동","울산달동","남구","동구","북구","울주군","중구"];
    const incheon = ["전체","송도","영종도","강화도","구월동","부평","부평역","청라","을왕리","소래포구","차이나타운","월미도","주안","강화군","계양구","남동구","동구","미추홀구","부평구","서구","연수구","옹진군","중구"];
    const jeonnam = ["전체","여수","춘천","목포","담양","광양","나주","화순","강진군","고흥군","곡성군","광양시","구례군","나주시","담양군","목포시","무안군","보성군","순천시","신안군","여수시","영광군","영암군","완도군","장성군","장흥군","진도군","함평군","해남군","화순군"];
    const jeonbuk = ["전체","전주","군산","익산","남원","고창","부안","전주한옥마을","선유도","완주","고창군","군산시","김제시","남원시","무주군","부안군","순창군","완주군","익산시","임실군","장수군","전주시","전주시 덕진구","전주시 완산구","정읍시","진안군"];
    const jeju = ["전체","서귀포","제주시","애월","제주공항","중문","함덕","우도","협재","성산","성산일출봉","월정리","표선","서귀포시","제주시"];
    const chungnam = ["전체","천안","공주","당진","태안","서산","아산","부여","보령","안면도","불당동","논산","계룡시","공주시","금산군","논산시","당진시","보령시","부여군","서산시","서천군","아산시","예산군","천안시","천안시 동남구","천안시 서북구","청양군","태안군","홍성군"];
    const chungbuk = ["전체","청주","제천","충주","단양","오창","진천","옥천","음성","오송","괴산군","단양군","보은군","영동군","옥천군","음성군","제천시","증평군","진천군","청주시","청주시 상당구","청주시 서원구","청주시 청원구","청주시 흥덕구","충주시"];
    
  
    if (e.value == "1") {
      add = seoul;
      e.style = 'red';
    } else if (e.value == "2") {
      add = gangwon;
    } else if (e.value == "3") {
      add = gyeonggi;
    } else if (e.value == "4") {
      add = gyeongnam;
    } else if (e.value == "5") {
      add = gyeongbug;
    } else if (e.value == "6") {
      add = gwangju;
    } else if (e.value == "7") {
      add = daegu;
    } else if (e.value == "8") {
      add = daejeon;
    } else if (e.value == "9") {
      add = busan;
    } else if (e.value == "10") {
      add = sejong;
    } else if (e.value == "11") {
      add = ulsan;
    } else if (e.value == "12") {
      add = incheon;
    } else if (e.value == "13") {
      add = jeonnam;
    } else if (e.value == "14") {
      add = jeonbuk;
    } else if (e.value == "15") {
      add = jeju;
    } else if (e.value == "16") {
      add = chungnam;
    } else if (e.value == "17") {
      add = chungbuk;
    }
  
    //state.options.length = 1;
    // 군/구 갯수;
    // if(state.length > 1){
    //   state.li.remove();
    // }

    for (property in add) {
      //let opt = document.createElement("li");
      let opt = document.createElement('button');

      
      opt.value = add[property];
      opt.innerHTML = add[property];
      opt.onclick = press1;
      state.appendChild(opt);
    }


  }

function press1(e){
    const state1 = document.getElementById("state1") ;
    state1.innerText = "";
    const a1 = ["전체"];
    const b1 = ["전체"];
    const c1 = ["전체"];
    const d1 = ["전체"];
    const e1 = ["전체"];
    const f1 = ["전체"];
    const g1 = ["전체"];
    const h1 = ["전체"];
    const i1 = ["전체"];
    const j1 = ["전체"];
    const k1 = ["전체"];
    const l1 = ["전체"];
    const m1 = ["전체"];
    const n1 = ["전체","강화읍","교동면","길상면","내가면","'불은면","삼산면","서도면","선원면","송해면","양도면","양사면","하점면","화도면"];
    const o1 = ["전체","계양구청","계산","계산택지","갈현동","계산동","귤현동","다남동","동양동","둑실동","목상동","박촌동","방축동","병방동","상야동","서운동","선주지동","오류동","용종동","이화동","임학동","작전동","장기동","평동","하야동","효성동"];
    const p1 = ["전체","구월동","소래포구","예술회관역","인천터미널","인천시청","인천논현동","간석동","고잔동","구월동","남촌동","논현동","도림동","만수동","서창동","수산동","십정동","운연동","장수동"];
    const q1 = ["전체","금곡동","만석동","송림동","송현동","창영동","화수동","화평동"];
    const r1 = ["전체","주안","주안역","인하대","인하대후문","인천용현동","인천터미널역","관교동","도화동","문학동","숭의동","용현동","주안동","학익동"];
    const s1 = ["전체","부평역","부평구청","부평시장역","굴포천역","부평시장","부평구청역","간석동","갈산동","구산동","부개동","부평동","산곡동","삼산동","십정동","일신동","청천동"];
    const t1 = ["전체","청라","인천서구청","천안병천","청라지구","국제성모병원","가정동","가좌동","검암동","경서동","공촌동","금곡동","당하동","대곡동","마전동","백석동","불로동","석남동","시천동","신현동","심곡동","연희동","오류동","왕길동","원당동","원창동","청라동"];
    const u1 = ["전체","송도","테크노파크역","송도신도시","동춘역","선학동","송도동","연수동","옥련동","청학동","학익동"];
    const v1 = ["전체","영흥도","대청면","덕적면","백령면","북도면","연평면","영흥면","자월면"];
    const w1 = ["전체","영종도","을왕리","차이나타운","월미도","인천공항","연안부두","운서역","동인천역","신포시장","경동","관동","남북동","내동","답동","덕교동","도원동","무의동","북성동","사동","선린동","선화동","송월동","송학동","신생동","신포동","신흥동","용동","운남동","운북동","운서동","유동","율목동","을왕동","인현동","전동","중산동","중앙동","항동","해안동"];

    //let opt1 = document.createElement("li");
    if(e.target.value == "전체"){
      add1 = a1;
    } else if(e.target.value == "송도"){
      add1 = b1;
    } else if(e.target.value == "영종도"){
      add1 = c1;
    } else if(e.target.value == "강화도"){
      add1 = d1;
    } else if(e.target.value == "구월동"){
      add1 = e1;
    }  else if(e.target.value == "부평"){
      add1 = f1;
    }  else if(e.target.value == "부평역"){
      add1 = g1;
    }  else if(e.target.value == "청라"){
      add1 = h1;
    }  else if(e.target.value == "을왕리"){
      add1 = i1;
    }  else if(e.target.value == "소래포구"){
      add1 = j1;
    }  else if(e.target.value == "차이나타운"){
      add1 = k1;
    }  else if(e.target.value == "월미도"){
      add1 = l1;
    }  else if(e.target.value == "주안"){
      add1 = m1;
    }  else if(e.target.value == "강화군"){
      add1 = n1;
    }  else if(e.target.value == "계양구"){
      add1 = o1;
    }  else if(e.target.value == "남동구"){
      add1 = p1;
    }  else if(e.target.value == "동구"){
      add1 = q1;
    }  else if(e.target.value == "미추홀구"){
      add1 = r1;
    }  else if(e.target.value == "부평구"){
      add1 = s1;
    }  else if(e.target.value == "서구"){
      add1 = t1;
    }  else if(e.target.value == "연수구"){
      add1 = u1;
    }  else if(e.target.value == "옹진군"){
      add1 = v1;
    }  else if(e.target.value == "중구"){
      add1 = w1;
    }
    
    for (property in add1) {
      let opt1 = document.createElement('button');
      opt1.value = add1[property];
      opt1.innerHTML = add1[property];
      state1.appendChild(opt1);
    }
  };